loadTest/demo.yml
config:
  target: 'http://127.0.0.1:3000'
  phases:
    - duration: 1
      arrivalRate: 1
scenarios:
  # mimic typical control flow of remote play session
  - flow:
    # login
    - post:
        url: "/api/login?username=Rob&password=myPassword"
        capture:
          json: "$.cookie"
          as: "hostCookie"
    # create game
    - post:
        url: "/api/game?hostCookie={{ hostCookie }}&name=myGame"
        capture:
          - json: "$"
            as: "gameData"
          - json: "$.gameID"
            as: "gameID"
    # make requests from host
    - loop:
        - put:
            url: "/api/game?gameData={{ gameData }}"
      count: 500
    # login with new user
    - post:
        url: "/api/login?username=Dylan&password=myPassword1"
        capture:
          json: "$.cookie"
          as: "clientCookie"
    # join host game
    - get:
        url: "/api/game?gameID={{ gameID }}&cookie={{ clientCookie }}"
        capture:
          json: "$"
          as: "gameData"
    # make requests from client
    - loop:
        - put:
            url: "/api/game?gameData={{ gameData }}"
      count: 500